In [1]:
import pandas
data = pandas.read_csv('titanic.csv', index_col='PassengerId')

In [2]:
data[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [10]:


f3 = open('3.txt', 'w')
f4 = open('4.txt', 'w')

f6 = open('6.txt', 'w')

In [11]:
f1 = open('1.txt', 'w')
f1.write(str(data.Sex[data.Sex=="male"].count())+' '+str(data.Sex[data.Sex=="female"].count()))

7

In [12]:
f2 = open('2.txt', 'w')
f2.write(str(round(data.Survived[data.Survived==1].count()/data.Survived.count()*100,2)))

5

In [26]:
f5 = open('5.txt', 'w')

f5.write(str(round(data['SibSp'].corr(data['Parch']),2)))

4

In [27]:
f1.close()
f2.close()
f3.close()
f4.close()
f5.close()
f6.close()

In [124]:
data_female=data[data['Sex']=='female']
data_female

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [125]:
#names=data_female['Name'].values
import re
def find_name(name):
    
    s = re.search('\((.+)\)', name)
    if s:
        name = s.group(1)
    s=re.search('^[^.]+\. (.*)',name)
    if s:
        name = s.group(1)
    s=re.search('(\w+)?',name)
    if s:
        name = s.group(1)
    return name
data_female['Name']=data_female['Name'].map(find_name)

c:\program files\python37\lib\site-packages\ipykernel_launcher.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  app.launch_new_instance()

In [126]:
data_female

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,Florence,female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,Lily,female,35.0,1,0,113803,53.1000,C123,S
9,1,3,Elisabeth,female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,Adele,female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
881,1,2,Imanita,female,25.0,0,1,230433,26.0000,NaN,S
883,0,3,Gerda,female,22.0,0,0,7552,10.5167,NaN,S
886,0,3,Margaret,female,39.0,0,5,382652,29.1250,NaN,Q
888,1,1,Margaret,female,19.0,0,0,112053,30.0000,B42,S
889,0,3,Catherine,female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [138]:
counts = data_female['Name'].value_counts()
f6 = open('6.txt', 'w')
f6.write(counts.head(1).index.values[0])
f6.close()